// კომენტარებით ახსენით რა არის setInterval-ი და clearInterval-ი


// setInterval არის ჯავასკრიპტის ფუნქცია, რომელიც საშუალებას გვაძლევს გავუშვათ რაღაც კოდი რაღაც ჩვენ მიერ გაწერილი დროის ინტერვალით. მაგალითად, თუ გვინდა რომ რაღაც ფუნქცია ყოველ 2 წამში შესრულდეს, შეგვიძლია გამოვიყენოთ setInterval:


// clearInterval არის ფუნქცია რომელიც გამოიყენება setInterval- ის გაჩერებისთვის. 

const interval = setInterval(() => {
    console.log("ეს მესიჯი ყოველ 2 წამში გამოჩნდება");
    clearInterval(interval);
}, 2000);


//  შექმენთ ფუნქცია, რომელსაც გამოიძახებთ ყოველ ერთ წამში, ფუნქციამ უნდა დაბეჭდოს ნებისმიერი ტექსტი. როდესაც 10-ჯერ დაიბეჭდება ეს ტექსტი ფუნქციის გაშვება უნდა შეწყდეს


let count = 0

const interval1 = setInterval(() =>{
    console.log('ეს ტექსტი იბეჭდება ყოველ 1 წამში')
    count++

    if(count ===10){
        clearInterval(interval1)
    }
},1000)