//  დაატრიალეთ for ციკლი 0 დან 38 ის ჩათვლით და გამოიტანე თითოეული რიცხვი console-ში

for (let i = 0; i <= 38; i++) {
    console.log(i);
}

//  დაატრილეთ for ციკლი 30 დან 40 მდე  და გამოიტანე თითოეული რიცხვი console-ში

for (let i = 30; i <= 40; i++) {
    console.log(i);
}


// დაატრიალეთ for ციკლი 12 იდან 120 მდე  და გამოიტანე თითოეული რიცხვი console-ში


for (let i = 12; i<=120; i++){
    console.log(i)
}


// დაატრიალეთ for ციკლი და გამოიტანეთ თქვენი სახელი 18 ჯერ console-ში

for (let i = 0; i<=18; i++) {
    console.log("ANDRIA");
}


//  დაატრიალეთ for ციკლი 10 დან 100 მდე 3 step ის გამოტოვებით და გამოიტანეთ თითოეული რიცხვი console-ში


for (let i = 10; i <= 100; i+=3) {
    console.log(i);
}

// console-ში გამოიტანეთ თქვენი საყვარელი ხილის სახელი 30 ჯერ და თან დანომრეთ, მიიღეთ ქვემოთ მოცემულის ნაირი შედეგი
// 1 ფორთოხალი
// 2 ფორთოხალი
// 3 ფორთოხალი
// 4 ფორთოხალი
// 5 ფორთოხალი

for (let i = 1; i <= 30; i++) {
    console.log(i + " ფორთოხალი");
}


// გამოიტანეთ თქვენი სახელი 10 ჯერ while loop ის გამოყენებით

let i = 0;
while (i < 10) {
    console.log("ANDRIA");
    i++;
}


// დაითვალეთ 0 დან 24 მდე გამოიყენეთ while loop

let j = 0;
while (j <= 24){
    console.log(j);
    j++;
}