
// scope არის ის ნაწილი სადაც ცვლადები და ფუნქციები ხელმისაწვდომია. JavaScript-ში არსებობს რამდენიმე სახის scope:

// 1. გლობალური scope (Global Scope):

// 2. ფუნქციური scope (Function Scope):

// 3. ბლოკური scope (Block Scope):

//  კომენტარების სახით ახსენით თუ რა განსხვავებაა global და block scope-ებს შორის

// გლობალური scope-ში განსაზღვრული ცვლადები ხელმისაწვდომია მთელი სკრიპტის განმავლობაში, ხოლო ბლოკურ scope-ში განსაზღვრული ცვლადები ხელმისაწვდომია მხოლოდ იმ ბლოკის ფარგლებში, სადაც ისინი განსაზღვრულია (მაგალითად, if ან for ბლოკებში).

//  კომენტარების სახით ახსენით თუ რა არის window ობიექტი და რა დანიშნულება აქვს საერთოდ, რისთვის შეგვიძლია გამოვიყენოთ?

// window ობიექტი არის გლობალური ობიექტი ბრაუზერში, რომელიც წარმოადგენს ბრაუზერის ფანჯარას. მისი დახმარებით შეგვიძლია მივწვდეთ გლობალურ ფუნქციებს და ცვლადებს

//  კომენტარების სახით ახსენით თუ რა არის scope pollution და როგორ მუშაობს?

// scope pollution არის პრობლემა, რომელიც წარმოიქმნება მაშინ, როდესაც გლობალურ scope-ში ბევრი ცვლადი და ფუნქციაა განსაზღვრული.

//  ივარჯიშეთ scope-ების სწორი პრაქტიკის გამოყენებაზე და დაუკვირდით მათ გამოყენებას კოდის წერისას, გააკეთეთ რამდენიმე მაგალითებიც



//global scope
const globalVar = "Im a global variable";

function showGlobalVar() {
    console.log(globalVar);

}

showGlobalVar();




// block scope
if (true) {
    let blockVar = "Im a block variable";
    console.log(blockVar); 
}

