import { useState } from 'react'
import { createRoot } from 'react-dom/client'

function App() {
    return (
      <h1>hello react</h1>
    );
}

export default App

//  კომენტარებით ახსენით რატომ იწერება ზოგიერთი ატრიბუტი jsx-ში და ჩამოთვალეთ თქვენთვის ცნობილი მსგავსი ატრიბუტები

// jsx - ში ზოგიერთი ატრიბუტი განსხვავებულად იწერება ვიდრე მაგალთად html ში მაგალითად ჩვენთვის ცნობილი არის რომ class მაგივრად jsx - ში უნდა დავწეროთ ჩვენ className ხოლო for მაგივრად უნდა დავწეროთ htmlFor


// კომენტარებით ახსენით რატომ იწერება ზოგიერთი ატრიბუტი jsx-ში და ჩამოთვალეთ თქვენთვის ცნობილი მსგავსი ატრიბუტები

// self closing თეგი არის მაგალთად img ანუ როცა მას გამოვიყენებთ ჩვენ ყოველთვის ბოლოში უნდა დავუწეროთ / - ხაზი რათა მან იმუშაოს ანუ ჩვენ ის უნდა დავხუროთ ჩვენი ავტომატურად არ დაიხურება კიდევ არის მაგალითად input, br და აშ.






