// // შექმენი ფილმების საიტი, სადაც გექნება შემდეგი ძირითადი ღილაკები: ფილმის დამატება, ყველა ფილმის წაშლა

// როდესაც მომხმარებელი დააკლიკებს ფილმების დამატების ღილაკს, გამოუტანეთ მას ორი prompt, პირველში მომხმარებელმა შეიყვანოს ფილმის სახელი, მეორეში კი ფილმის ფოტოს URL-ი.

// მიღებული ინფორმაციისგან შექმენით ობიექტი და ჩაამატეთ ის movies სიაში.

// ფილმის დამატების შემდეგ ის ვიზუალურადაც იმდა გამოჩნდეს საიტზე.

// ეს რომ გააკეთოთ ყოველ ჯერზე როცა ფილმი დაემატება movies სიაში, გადაუარეთ for ციკლით ამ სიას და დაამატეთ innerHTML-ის მეშვეობით ელემენტები.(სანამ ამას იზამთ ჯერ ყოველ ჯერზე უნდა გაასუფთავოთ div-ი ან ის ელემენტი, სადაც ფილმებს არენდერებთ)

// თითოეული ფილმის გამოსატანად გამოიყენეთ div-ი, სადაც გექნებათ ფოტო და პარაგრაფი, ფილმის სახელით.
// ასევე ღილაკი Delete(ამას საშინაოდ ავამუშავებთ)



let movies = [];

function addMovie() {
  let name = prompt("შეიყვანეთ ფილმის სახელი:");
  let url = prompt("შეიყვანეთ ფილმის ფოტოს URL-ი:");    

    let movie = {
        name: name,
        url: url
    };

    movies.push(movie);}

