// ახსენით რაში გამოიყენება forEach map filter reduce,

// forEach - გამოიყენეა მასივის თითოეული ელემენტის გადასავლელად და რაღაც ოპერაციის შესასრულებლად. ის არ აბრუნებს ახალ მასივს, map ის გან განსხვავებით 

// map - გამოყენება რაღაც მათემატიკური ოპერაციების შესასრულებლად მაგალითად რიცხვების მისამატებლად და გამოსაკლებად ასევე გასამრავლებლად ის ქმნის ახალ მასივს.

// filter - გამოიყენება იმისთვის რომ მასივი გაფილტროს და მხოლოდ ის ელემენტები დააბრუნოს რომელიც ჩვენ მიერ დაწერილ პირობას აკმაყოფილებს.

// reduce - გამოიყენება მასივის ელემენტების ჯამის გამოსათვლელად ან სხვა ოპერაციების შეასრულებლად. ის იღებს callback ფუნქციას და მასივის თითოეული ელემენტის მნიშვნელობას ამ ფუნქციაში გადასცემს, საბოლოოდ კი აბრუნებს ერთ მნიშვნელობას.

//  შექმენით რიცხვების მასივი, თქვენი დავალებაა დაბეჭდოთ კონსოლში თითოეული რიცხვი და მის გვერდით ტექსტი:
const numbers = [1, 2, 3, 4, 5];

numbers.forEach(function(numbers){
    console.log(`number is: ${numbers}`)
})


//  შექმენით რიცხვების მასივი, დატოვე მხოლოდ ისეთი რიცხვები რომელიც არის ლუწი და არის მეტი 5 ზე

const number = [1,2,3,4,5,6,7,8,9,10]

const evenNumbers = number.filter(function(number){
    return number % 2 === 0 && number > 5
})

console.log(evenNumbers)

// 4) შექმენით რიცხვების მასივი, reduce ის მეშვეობით იპოვე მასივში არსებული რიცხვების საშვალო 
const num = [1,2,3,4,5]
const average = num.reduce(function(a,b){
    return a + b
}, 0) / num.length

console.log(average)



// შექმენით რიცხვების მასივი, შენი დავალებაა დატოვო მხოლოდ ლუწი რიცხვები, შემდგომ დარჩენილი რიცხვები გაამრავლეთ 3 ზე, და საბოლოოდ გაიგეთ მასივში არსებული რიცხვების ჯამი

const nums = [1,2,3,4,5,6,7,8,9,10]
const evenNums = nums.filter(function(num){
    return num % 2 === 0
})


const Multiplication = nums.map(function(num){
    return num * 3
})

const sum = nums.reduce(function(a,b){
    return a + b
}, 0)

console.log(evenNums)
console.log(Multiplication)
console.log(sum)